Repository: ZeltikXD/FormsCreator
Catalog: FormsCreator.Application/Resources/ValidationMessages.*.resx
Languages: es

# AnswerQuestionId
source: The question id cannot be empty.
es: El id de la pregunta no puede estar vacío.

# AnswerFormId
source: The answer cannot contain the form id itself.
es: La pregunta no puede contener el id el mismo.

# AnswerValueMax
source: You have exceeded the max length of the value field.
es: Ha excedido la cantidad de caracteres máxima del campo valor.

# AnswerRowMax
source: You have exceeded the max length of the row field.
es: Ha excedido la cantidad de caracteres máximo del campo de fila.

# AnswerColumnMax
source: You have exceeded the max length of the column field.
es: Ha excedido la cantidad de caracteres máximo del campo columna.

# AnswerValueNotEmpty
source: The value cannot be empty if you are not using a multiselector type of question.
es: El valor no puede estar vacío si no está utilizando un tipo de pregunta de multiselección.

# AnswerRowNotEmpty
source: The row cannot be empty if you are not using the simple types of question.
es: La fila no puede estar vacía si no está utilizando los tipos de preguntas simples.

# AnswerColumnNotEmpty
source: The column cannot be empty if you are not using the simple types of question.
es: La columna no puede estar vacía si no está utilizando los tipos de preguntas simples.

# CommentContentMax
source: You have exceeded the max length of the comment.
es: Ha excedido la cantidad de caracteres máximos del comentario.

# CommentContentNotEmpty
source: The comment cannot be empty.
es: El comentario no puede estar vacío.

# CommonTemplateId
source: The template id cannot be empty.
es: El id de la plantilla no puede estar vacío.

# FormAnswersNotEmpty
source: The form must have answers.
es: El formulario debe tener respuestas.

# FormId
source: The form id cannot be empty.
es: El id del formulario no puede estar vacío.

# QuestionTextMax
source: You have exceeded the max length of the question.
es: Ha excedido la cantidad de caracteres máxima de la pregunta.

# QuestionDescMax
source: You have exceeded the max length of the description.
es: Ha excedido la cantidad de caracteres máxima de la descripción.

# QuestionTextNotEmpty
source: The question title cannot be empty.
es: El título de la pregunta no puede estar vacío.

# QuestionType
source: The question type is not valid.
es: El tipo de pregunta no es válido.

# QuestionOptionValueNotEmpty
source: The value cannot be empty.
es: El valor no puede estar vacío.

# QuestionOptionValueMax
source: You have exceeded the max length of the value.
es: Ha excedido la cantidad de caracteres máximos del valor.

# TemplateTitleMax
source: You have exceeded the max length of the title.
es: Ha excedido la cantidad máxima de caracteres para el título.

# TemplateTitleNotEmpty
source: The template title cannot be empty.
es: El título de la plantilla no puede estar vacío.

# TemplateDescNotEmpty
source: The template description cannot be empty.
es: La descripción de la plantilla no puede estar vacía.

# TemplateDescMax
source: You have exceeded the max length of the description.
es: Ha excedido la cantidad máxima de caracteres de la descripción.

# TemplateTopicId
source: The template must include a topic.
es: La plantilla debe incluir un tema de interés.

# UserLoginUserOrEmail
source: The username/email field cannot be empty.
es: El campo de nombre de usuario/correo no puede estar vacío.

# TagNameNotEmpty
source: The tag name cannot be empty.
es: El nombre del tag no puede estar vacío.

# TagNameMax
source: You have exceeded the max length of the tag.
es: Ha excedido los caracteres máximos del tag.

# TemplateImageIsNotImage
source: The uploaded file must be an image.
es: El archivo subido debe ser una imagen.

# TemplateIsPublic
source: Is public?
es: ¿Es público?

# QuestionOptionRowNotEmpty
source: The row cannot be empty when the column and the value are empty.
es: La fila no puede estar vacía cuando la columna y el valor si lo están.

# QuestionOptionColumnNotEmpty
source: The column cannot be empty when the row and value are empty.
es: La columna no puede estar vacía cuando el valor y la fila si lo están.

# TemplateQuestionsNotEmpty
source: The template must contain questions.
es: La plantilla debe contener preguntas.

# UserLoginWithoutPassword
source: The password must be entered.
es: La contraseña debe ser ingresada.

# UserExternalService
source: This user was registered by an external service, please use the external service to log in.
es: Este usuario fue registrado por un servicio externo, utilice el servicio externo para iniciar sesión.

# TemplateAccessRangeUserIdsNotEmpty
source: The list of user ids cannot be empty.
es: La lista de ids de usuarios no puede estar vacía.

# NoFormsText
source: There are not forms at this moment.
es: No hay formularios en este momento.
